AccumulationRegisters/ОборотыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоКатегориям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДБ_ОбщегоНазначенияСервер/Ext/Module.bsl
// Возвращает лимит категории с учетом иерархии. Если лимит не задан на текущем уровне, берется значение из родительской категории.
//
// Параметры:
//   СсылкаНаКатегорию - СправочникСсылка - Ссылка на категорию
//
// Возвращаемое значение:
//   Число - Лимит категории (неотрицательное число)
Функция ПолучитьЛимитКатегории(СсылкаНаКатегорию) Экспорт
	Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
		Возврат 0;
	КонецЕсли;
	
	Лимит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Лимит");
	
	Если (Лимит = 0 Или Лимит = Неопределено) Тогда
		Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Родитель");
		
		Если ЗначениеЗаполнено(Родитель) Тогда
			Лимит = ПолучитьЛимитКатегории(Родитель);
		КонецЕсли;
		КонецЕсли;
		
		Возврат ?(Лимит < 0, 0, Лимит);
КонецФункции  

// Возвращает суммы расходов пользователя по категориям за указанный период.
//
// Параметры:
//   СсылкаНаПользователя - СправочникСсылка.Пользователи - пользователь, для которого формируется отчет
//   ДатаНачало - Дата - начало периода
//   ДатаОкончание - Дата - конец периода
//
// Возвращаемое значение:
//   Соответствие - ключ (КатегорияРасхода), значение (Сумма)
Функция ПолучитьСуммыРасходовПоКатегориям(СсылкаНаПользователя, ДатаНачало, ДатаОкончание) Экспорт
	Запрос = Новый Запрос;
	   Запрос.Текст=
	   "ВЫБРАТЬ
	   |	Обороты.Категория КАК Категория,
	   |	СУММА(ЕСТЬNULL(Обороты.СуммаРасход,0)) КАК Сумма
	   |ИЗ
	   |	РегистрНакопления.ОборотыПоКатегориям.Обороты(&Начало, &Конец,, Пользователь = &Пользователь ) КАК Обороты
	   |СГРУППИРОВАТЬ ПО
	   | Обороты.Категория";
	   Запрос.УстановитьПараметр("Начало", ДатаНачало);
	   Запрос.УстановитьПараметр("Конец", ДатаОкончание);
	   Запрос.УстановитьПараметр("Пользователь", СсылкаНаПользователя);
	   Выборка = Запрос.Выполнить().Выбрать();
	   Результат = Новый Соответствие;
	   Пока Выборка.Следующий() Цикл
		   Результат.Вставить(Выборка.Категория, Выборка.Сумма);
		   КонецЦикла;
	   Возврат Результат;
КонецФункции

// Возвращает сумму расходов по категории за текущий месяц.
//
// Параметры:
//   СсылкаНаКатегорию - СправочникСсылка - категория расходов
//   СсылкаНаПользователя - СправочникСсылка - пользователь
//
// Возвращаемое значение:
//   Число - сумма расходов по категории
Функция ПолучитьСуммуРасходаЗаМесяц(СсылкаНаКатегорию, СсылкаНаПользователя)Экспорт 
	   ВсеСуммы = ПолучитьСуммыРасходовПоКатегориям(СсылкаНаПользователя, НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	   Если ВсеСуммы.Свойство(СсылкаНаКатегорию) Тогда
		   Возврат ВсеСуммы[СсылкаНаКатегорию];
	   КонецЕсли;
	   Возврат 0;
КонецФункции

#Область ОбработчикиСобытийДокументов
// Выполняет предварительную обработку документа перед записью: генерирует номер, устанавливает курс валюты и проверяет обязательные реквизиты
//
// Параметры:
//   Источник - ДокументОбъект - документ, для которого выполняется обработка
//   Отказ - Булево - флаг отказа от записи документа
//   МассивОбязательныхРеквизитов - Массив из Строка - массив имен обязательных реквизитов для проверки
//   Режим - РежимЗаписиДокумента - режим записи документа
//   РежимПроведения - РежимПроведенияДокумента - режим проведения документа
Процедура ОбработкаДокументовПередЗаписью(Источник, Отказ, МассивОбязательныхРеквизитов, МассивОбязательныхРеквизитовТЧ, Режим, РежимПроведения) Экспорт
	ИмяДокумента = Источник.Метаданные().Имя;
	СгенерироватьНомерДокумента(Источник);
	
	Если ЗначениеЗаполнено(Источник.Валюта) Тогда
		Если Источник.Валюта.КодВалюты <> "RUB" Тогда
			Источник.Курс = ПолучитьКурсВалюты(Источник.Валюта,Источник.Дата);
		КонецЕсли;
		КонецЕсли;
	
	Если МассивОбязательныхРеквизитов <> Неопределено И МассивОбязательныхРеквизитов.Количество() > 0 Тогда
		ОбязательныеРеквизиты = СоздатьСоответствиеОбязательныхРеквизитов(МассивОбязательныхРеквизитов);
	ПроверитьОбязательныеРеквизитыДокумента(Источник, ОбязательныеРеквизиты, Отказ);
	КонецЕсли;
	Если МассивОбязательныхРеквизитовТЧ <> Неопределено И МассивОбязательныхРеквизитовТЧ.Количество() > 0 Тогда
		ОбязательныеРеквизитыТЧ = СоздатьСоответствиеОбязательныхРеквизитовТЧ(МассивОбязательныхРеквизитовТЧ);
		ПроверитьОбязательныеРеквизитыДокументаТЧ(Источник, ОбязательныеРеквизитыТЧ, Отказ);
		КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область НумерацияДокументов

// Возвращает номер документа, генерируя его на основе максимального номера для текущего года или возвращая существующий
//
// Параметры:
//   ОбъектДокумент - ДокументОбъект - документ, для которого генерируется номер
//
// Возвращаемое значение:
//   Строка - сгенерированный или существующий номер документа в формате "ИмяДок-Год-Номер"
Функция СгенерироватьНомерДокумента(ОбъектДокумент) Экспорт
	Если Не ПустаяСтрока(ОбъектДокумент.Номер) Тогда
		Возврат ОбъектДокумент.Номер;
	КонецЕсли;
	ИмяОбъекта = ОбъектДокумент.Метаданные().Имя;
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ." + ИмяОбъекта);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"Выбрать
	| Максимум(Документы.Номер) Как ПоследнийНомер
	|ИЗ
	| Документ." + ИмяОбъекта + " КАК Документы
	|ГДЕ
	| Документы.Номер ПОДОБНО &Маска";
	Префикс = ИмяОбъекта + "-";
	Год = Формат(ОбъектДокумент.Дата, "ДФ=уууу");
	Маска = Префикс + Год + "-%";
	Запрос.УстановитьПараметр("Маска", Маска);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ПоследнийНомер) Тогда
		НомерЧасть = СтрЗаменить(Выборка.ПоследнийНомер, Префикс + Год + "-", "");
		СледующийНомер = Число(НомерЧасть) + 1;
	Иначе
		СледующийНомер = 1;
	КонецЕсли;
	НовыйНомер = Префикс + Год + "-" + Формат(СледующийНомер, "ЧЦ=6; ЧВН=");
	Возврат НовыйНомер;
КонецФункции
#КонецОбласти

#Область РаботаСВалютой
// Переводит сумму в рубли по курсу валюты
//
// Параметры:
//  Сумма - Число - сумма в исходной валюте
//  Валюта - СправочникСсылка.Валюты - валюта суммы
//  Курс - Число - курс валюты (если не передан, берётся из регистра курсов)
//
// Возвращаемое значение:
//  Число - сумма в рублях
//
Функция ПолучитьСуммуВРублях(Сумма, Валюта, Курс=0) Экспорт
	Если Валюта = Неопределено ИЛИ Валюта.КодВалюты = "RUB" Тогда
		Возврат Сумма;
	КонецЕсли;
	КурсИспользуемый = Курс;
	Если КурсИспользуемый = 0 Тогда
		КурсИспользуемый = ПолучитьКурсВалюты(Валюта, ТекущаяДата());
	КонецЕсли;
	Возврат Сумма * КурсИспользуемый;
КонецФункции
// Получает курс валюты на дату
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты - валюта
//  Дата - Дата - дата получения курса
//
// Возвращаемое значение:
//  Число - курс валюты (по умолчанию 1)
//
Функция ПолучитьКурсВалюты(Валюта, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст=
	"Выбрать
	|	ЕстьNull(КурсВалют.Курс, 1) КАК Курс
	|ИЗ
	| РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсВалют";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Курс;
	КонецЕсли;
	Возврат 1;
КонецФункции
#КонецОбласти

#Область ПроверкиДокументов
// Проверяет обязательные реквизиты документа и показывает ошибки пользователю
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проверяемый документ
//  ОбязательныеРеквизиты - Соответствие - где ключ=ИмяРеквизита, значение=ТекстОшибки
//  Отказ - Булево - признак отказа от записи
//
Процедура ПроверитьОбязательныеРеквизитыДокумента(ДокументОбъект, ОбязательныеРеквизиты, Отказ) Экспорт
	Для Каждого КлючИЗначение Из ОбязательныеРеквизиты Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ТекстОшибки = КлючИЗначение.Значение;
		Если НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизита]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,,ИмяРеквизита,"Объект",Отказ);
		КонецЕсли;
		КонецЦикла;
КонецПроцедуры

// Проверяет заполнение обязательных реквизитов в табличных частях документа и формирует сообщения об ошибках пользователю.
//
// Параметры:
//   ДокументОбъект - ДокументОбъект - проверяемый документ
//   ОбязательныеРеквизитыТЧ - Соответствие - структура вида "ИмяТЧ.ИмяРеквизита" -> "ТекстОшибки"
//   Отказ - Булево - признак отказа от проведения записи
Процедура ПроверитьОбязательныеРеквизитыДокументаТЧ(ДокументОбъект,ОбязательныеРеквизитыТЧ,Отказ) Экспорт
	Для Каждого КлючИЗначение Из ОбязательныеРеквизитыТЧ Цикл
		ПолныйПутьРеквизита = КлючИЗначение.Ключ;
		ТекстОшибки = КлючИЗначение.Значение;
		ПозицияТочки = Найти(ПолныйПутьРеквизита, ".");
		ИмяТЧ = Лев(ПолныйПутьРеквизита, ПозицияТочки - 1);
		ИмяРеквизита = Сред(ПолныйПутьРеквизита, ПозицияТочки + 1);
		Для Каждого СтрокаТЧ из ДокументОбъект[ИмяТЧ] Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизита]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + " (строка " + СтрокаТЧ.НомерСтроки + ")"
				,,
				ИмяТЧ + "." + ИмяРеквизита,
				"Объект",
				Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Создаёт соответствие обязательных реквизитов с текстом ошибки
//
// Параметры:
//  МассивРеквизитов - Массив - массив имён обязательных реквизитов
//  ПрефиксТекста - Строка - префикс текста ошибки (по умолчанию "Не заполнен")
//
// Возвращаемое значение:
//  Соответствие - где ключ = ИмяРеквизита, значение = ТекстОшибки
//	
Функция СоздатьСоответствиеОбязательныхРеквизитов(МассивРеквизитов, ПрефиксТекста = "Не заполнен") Экспорт
	Результат = Новый Соответствие;
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл
		ТекстОшибки = ПрефиксТекста + " " + ИмяРеквизита + "!";
		Результат.Вставить(ИмяРеквизита, ТекстОшибки);
	КонецЦикла;
	Возврат Результат;
КонецФункции	

// Создает соответствие имен обязательных реквизитов табличной части с текстами сообщений о незаполненности.
//
// Параметры:
//   МассивРеквизитовТЧ - Массив из Строка - имена обязательных реквизитов табличной части
//   ПрефиксТекста - Строка - префикс сообщения об ошибке
//
// Возвращаемое значение:
//   Соответствие - ключ: имя реквизита (Строка), значение: текст ошибки (Строка)
Функция СоздатьСоответствиеОбязательныхРеквизитовТЧ(МассивРеквизитовТЧ, ПрефиксТекста = "Не запрлнен") Экспорт
	Результат = Новый Соответствие;
	Для Каждого ИмяРеквизитаТЧ Из МассивРеквизитовТЧ Цикл
		ТекстОшибки = ПрефиксТекста + " " + ИмяРеквизитаТЧ + "!";
		Результат.Вставить(ИмяРеквизитаТЧ, ТекстОшибки);
	КонецЦикла;
	Возврат Результат;
КонецФункции
#КонецОбласти
